load-test.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
  processor: "./main-processor.js"

scenarios:
  - name: "LOGIN_AND_SEARCH"
    flow:
      - post:
          url: "/login"
          json:
            email: "{{ $processEnvironment.API_USERNAME }}"
            password: "{{ $processEnvironment.API_PASSWORD }}"
          capture:
            json: "$.token"
            as: "authToken"
      - get:
          url: "/users/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - think: 1
      - get:
          url: "/services/public"
  - name: "LOAD_FILTERS_AND_SEARCH"
    flow:
      - get:
          url: "/categories"
      - get:
          url: "/genders"
      - get:
          url: "/ethnicities"
      - get:
          url: "/religions"
      - think: 1
      - get:
          url: "/services/public"
#  - name: "UPDATE_USERS"
#    beforeScenario: refreshTokenIfNeeded
#    flow:
#      - get:
#          url: "/users"
#          headers:
#            Authorization: "Bearer {{ authToken }}"
#          capture:
#            json: "$.users"
#            as: "users"
#      - loop:
#          foreach: "users"
#          do:
#            - put:
#                url: "/users/{{ $loopElement.id }}"
#                headers:
#                  Authorization: "Bearer {{ authToken }}"
#                json:
#                  "{{ $loopElement }}"
#                  merge:
#                    active: false