load-test.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
  processor: "./main-processor.js"

scenarios:
  - name: "LOGIN"
    flow:
      - post:
          url: "/login"
          json:
            email: "{{ $processEnvironment.API_USERNAME }}"
            password: "{{ $processEnvironment.API_PASSWORD }}"
          capture:
            json: "$.token"
            as: "authToken"
      - get:
          url: "/users/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "LOAD_FILTERS_AND_SEARCH"
    beforeScenario: refreshTokenIfNeeded
    flow:
      - get:
          url: "/categories"
      - get:
          url: "/genders"
      - get:
          url: "/ethnicities"
      - get:
          url: "/religions"
      - think: 1
      - get:
          url: "/services/public"

  - name: "UPDATE_USERS"
    flow:
      - post:
          url: "/login"
          json:
            email: "{{ $processEnvironment.API_USERNAME }}"
            password: "{{ $processEnvironment.API_PASSWORD }}"
          capture:
            json: "$.token"
            as: "authToken"
      - get:
          url: "/users"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            json: "$.data"
            as: "users"
            strict: false
#      - log: "users: {{ users }}"
      - function: "updateUsers"